def month_conv(m: str) -> str:
    month = {
        '01': 'Январь',
        '02': 'Февраль',
        '03': 'Март',
        '04': 'Апрель',
        '05': 'Май',
        '06': 'Июнь',
        '07': 'Июль',
        '08': 'Август',
        '09': 'Сентябрь',
        '10': 'Октябрь',
        '11': 'Ноябрь',
        '12': 'Декабрь'
    }
    return m
    # return f"{month.get(m.split('-')[1])} {m.split('-')[0]}"


def resolution_conv(r: str) -> str:
    return f"{r.split(' x ')[1]}x{r.split(' x ')[0]}"


def transfer(s: str) -> tuple:
    _list = list()
    _list.append(s.split(",")[0])
    _list.append(int(s.split(",")[1]))
    return tuple(_list)


month = {
    'Январь': '01',
    'Февраль': '02',
    'Март': '03',
    'Апрель': '04',
    'Май': '05',
    'Июнь': '06',
    'Июль': '07',
    'Август': '08',
    'Сентябрь': '09',
    'Октябрь': '10',
    'Ноябрь': '11',
    'Декабрь': '12'
}
